tap "hidetatz/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Matrix
brew "cmatrix"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Simple terminal UI for git commands
brew "lazygit"
# Utility for directing compilation
brew "make"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Fast, disk space efficient package manager
brew "pnpm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Colorize your kubectl output
brew "hidetatz/tap/kubecolor"
# Menu bar icon organizer
cask "bartender"
# Desktop password and login vault
cask "bitwarden"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# GPU-based terminal emulator
cask "kitty"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Email client
cask "microsoft-outlook"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# Native desktop client for WhatsApp
cask "whatsapp"
